
object DwdPreEntityPO{
  def main(args: Array[String]): Unit = {
    val reg = "([1,2][0-9]{3})([最高法|京|津|冀|晋|内|辽|吉|黑|沪|苏|浙|皖|闽|赣|鲁|豫|鄂|湘|粤|桂|琼|渝|川|黔|云|藏|陕|甘|青|宁|新|兵|军][0-9]{0,4})(澳请调|澳请送|港请调|港请送|民督监|民特监|民辖监|民辖终|赔辖终|请澳调|请澳送|请港调|请港送|请台调|请台送|请外调|请外送|请外移|请外引|请移管|请移赃|司惩复|司救访|司救民|司救赔|司救他|司救刑|司救行|司救执|台请调|台请送|委赔监|委赔提|委赔再|协外调|协外认|协外送|协外移|协外引|刑更备|刑更监|刑医复|刑医监|刑医解|刑止调|刑止核|行保复|行赔初|行赔监|行赔抗|行赔申|行赔再|行赔终|行审复|行辖终|助移管|助移赃|财保|法赔|民撤|民初|民催|民督|民监|民抗|民破|民申|民算|民他|民特|民辖|民再|民终|赔他|赔辖|认澳|认复|认港|认他|认台|司惩|委赔|协他|刑初|刑更|刑核|刑监|刑抗|刑没|刑申|刑他|刑辖|刑医|刑再|刑止|刑终|行保|行初|行监|行抗|行申|行审|行他|行辖|行再|行终|证保|执保|执复|执恢|执监|执他|执协|执异|执)()".r
    val reg_data = "(.+),(.+)".r
    "2021-02-01,2012-02-01" match {
      case reg_data(st,en) => print(st,en)
    }
  }
}、

(.